[
  {
    "id": 1,
    "title": "VivoV27 Pro: 7-point quick review",
    "image": "https://static.toiimg.com/thumb/resizemode-4,msid-98364437,width-800,height-450,imgv-75/98364437.jpg",
    "content": "Vivo has recently launched its new Vivo V27 Pro and Vivo V27 smartphones in India. The Vivo V27 Pro is the more premium of the two and also comes with better features and specifications. The handset is priced starting at Rs 37,999 for the base 8GB + 128GB variant and we have been using the phone for a while now. Here are our initial impressions of the phone. Colour-changing back is an add-on and gives it a unique look and feel Vivo V27 Pro comes with a colour-changing back. The Blue colour on our unit turned a little darker when exposed to sunlight. MediaTek Dimensity 8200 performs well The handset is powered by MediaTek Dimensity 8200 chipset paired with up to 12GB RAM. In the brief time, we used the phone, it offered smooth overall performance and we did not notice any delay or lag while navigating, opening or closing the app and even during multitasking."
  },
  {
    "id": 3,
    "title": "Hubble captured movie of DART smashing into an asteroid",
    "image": "https://www.techexplorist.com/wp-content/uploads/2023/03/DART-asteroid-impact-debris-696x392.jpg",
    "content": "The NASA/ESA Hubble Space Telescope captured a series of photos of rapid changes to the asteroid Dimorphos when it was deliberately hit by a 545-kilogram spacecraft on 26 September 2022. The primary objective of the NASA mission, called DART (Double Asteroid Redirection Test), was to test our ability to alter the asteroid’s trajectory as it orbits its larger companion asteroid, Didymos. Though Dimorphos poses no threat to Earth, data from the mission could help inform researchers how to potentially change an asteroid’s path away from Earth, if ever necessary. Hubble’s resulting time-lapse movie of the aftermath of the collision reveals surprising and remarkable changes as dust and chunks of debris were flung into space from the wounded asteroid. Smashing head-on into the asteroid at 21 000 kilometres per hour, the DART impactor blasted over 900 000 kilograms of dust off of the asteroid. The Hubble movie provides invaluable new clues into how the debris was dispersed into a complex pattern in the days following the impact. The movie shows three overlapping stages of the aftermath of the crash: the formation of an ejecta cone, the spiral swirl of debris caught up along the asteroid’s orbit about its companion asteroid, and the tail swept behind the asteroid by the pressure of sunlight."
  },
  {
    "id": 4,
    "title": "What is the real meaning of life? A study found the answer",
    "image": "https://www.techexplorist.com/wp-content/uploads/2019/12/happiness-696x464.jpg",
    "content": "What is the true meaning of life? No one can tell the actual definition of the meaning of life. For some, it is all about happiness, building a family, and leading life as it is. For some, it is about accumulating wealth, whereas, for some, it is all about love. Many think about the meaning and purpose in life from a philosophical perspective, but the meaning in life is associated with better health, wellness, and perhaps longevity, suggests a new study. A new study by the University of California San Diego School of Medicine found that meaning in life is essential for health and well-being. However, the relationships differ in adults younger and older than age 60. The study found that the meaning of life is associated with better physical and mental well-being. In comparison, the search for meaning in life may be associated with worse mental well-being and cognitive functioning."
  },
  {
    "id": 5,
    "title": "How to awaken neural stem cells and reactivate them?",
    "image": "https://www.techexplorist.com/wp-content/uploads/2023/03/Newly-produced-neurons-696x305.jpg",
    "content": "Cellular metabolism is essential for adult neural stem/progenitor cell (NSPC) behavior. These cells can be reactivated to form new neurons. However, its role in the transition from quiescence to proliferation has yet to be fully understood. A team led by scientists from the Universities of Geneva (UNIGE) and Lausanne (UNIL) has discovered the importance of cell metabolism in this process and identified how to wake up these neural stem cells and reactivate them. They successfully increased the number of new neurons in the brain of adult and even elderly mice. The brain is constructed during embryonic development by neural stem cells (NSCs), which produce all other central nervous system cells, including neurons. Interestingly, NSCs keep growing and can produce new neurons in specific brain regions even after the brain has fully developed. Adult neurogenesis is a biological process crucial for particular tasks, including memory and learning."
  },
  {
    "id": 6,
    "title": "Earthworm-inspired soft robot for future underground explorations",
    "image": "https://www.inceptivemind.com/wp-content/uploads/2023/03/earthwarm-robot-696x464.jpg",
    "content": "Robotic locomotion in subterranean environments is still unsolved. It requires innovative designs and strategies to overcome the challenges of burrowing and moving in unstructured conditions with high pressure and friction at depths of a few centimeters. Now, a team of researchers at Istituto Italiano di Tecnologia (IIT-Italian Institute of Technology) in Genoa has realized a new soft robot inspired by the biology of earthworms. The robot can crawl thanks to soft actuators that elongate or squeeze when air passes through them or is drawn out. The bio-inspired robot could be used for underground exploration, search and rescue operations in confined spaces, and the exploration of other planets. Nature offers many examples of animals, such as snakes, earthworms, snails, and caterpillars, which use both the flexibility of their bodies and the ability to generate physical traveling waves along the length of their body to move and explore different environments. Natural burrowers such as earthworms are entirely soft and possess a hydrostatic skeleton. They use alternating contractions of muscle layers to propel themselves both below and above the soil surface by generating retrograde peristaltic waves. The individual segments of their body (metameres) have a specific quantity of fluid that controls the internal pressure to exert forces and perform independent, localized, and variable movement patterns."
  },
  {
    "id": 7,
    "title": "Jupiter and Venus conjunction: Celestial dance reaches high point",
    "image": "https://image.telanganatoday.com/wp-content/uploads/2023/03/Jupiter_V_jpg--816x480-4g.webp?sw=1920&dsz=816x480&iw=659&p=false&r=1",
    "content": "The celestial dance between Jupiter and Venus reached a high point on Thursday, when both the planets on the night sky in Hyderabad came in conjunction and reached extremely close in proximity to each other.\\n\\nWhile amateur astronomers in Hyderabad were tracking the two planets steadily moving towards each other in the last few days, from Friday onwards, however, both the planets will start to move away from each other."
  },
  {
    "title": "SpaceX launches NASA Crew-6 mission",
    "image": "https://st.adda247.com/https://wpassets.adda247.com/wp-content/uploads/multisite/sites/5/2023/03/03093446/Axiom-d.jpg",
    "content": "SpaceX launched NASA's Crew-6 mission to the International Space Station from Florida as Elon Musk’s company begins the final of the original six missions it was awarded by NASA. SpaceX launched NASA’s Crew-6 mission to orbit en route to the International Space Station, with a Russian cosmonaut and United Arab Emirates astronaut joining two NASA crewmates for the flight.The SpaceX launch vehicle, consisting of a Falcon 9 rocket topped with an autonomously operated Crew Dragon capsule called Endeavour, lifted off at 12:34 a.m. EST (0534 GMT) from NASA’s Kennedy Space Center in Cape Canaveral, Florida.",
    "id": 8
  },
  {
    "title": "SpaceX launches NASA Crew-6 mission",
    "image": "https://st.adda247.com/https://wpassets.adda247.com/wp-content/uploads/multisite/sites/5/2023/03/03093446/Axiom-d.jpg",
    "content": "SpaceX launched NASA's Crew-6 mission to the International Space Station from Florida as Elon Musk’s company begins the final of the original six missions it was awarded by NASA. SpaceX launched NASA’s Crew-6 mission to orbit en route to the International Space Station, with a Russian cosmonaut and United Arab Emirates astronaut joining two NASA crewmates for the flight.The SpaceX launch vehicle, consisting of a Falcon 9 rocket topped with an autonomously operated Crew Dragon capsule called Endeavour, lifted off at 12:34 a.m. EST (0534 GMT) from NASA’s Kennedy Space Center in Cape Canaveral, Florida.",
    "id": 9
  },
  {
    "title": "SpaceX launches NASA Crew-6 mission",
    "image": "https://st.adda247.com/https://wpassets.adda247.com/wp-content/uploads/multisite/sites/5/2023/03/03093446/Axiom-d.jpg",
    "content": "SpaceX launched NASA's Crew-6 mission to the International Space Station from Florida as Elon Musk’s company begins the final of the original six missions it was awarded by NASA. SpaceX launched NASA’s Crew-6 mission to orbit en route to the International Space Station, with a Russian cosmonaut and United Arab Emirates astronaut joining two NASA crewmates for the flight.The SpaceX launch vehicle, consisting of a Falcon 9 rocket topped with an autonomously operated Crew Dragon capsule called Endeavour, lifted off at 12:34 a.m. EST (0534 GMT) from NASA’s Kennedy Space Center in Cape Canaveral, Florida.",
    "id": 10
  }
]